"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Unarchive to Current Folder";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Unarchive to Desktop";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Unarchive to...";